<h2> Python Basics

I. Cobalah print kalimat "Hello, my name is ***nama anda***" dengan minimal 2 cara: <br>
a.   Print biasa (nama diletakkan langsung dalam string yang di print)<br>
b.  Menggunakan variabel (nama disimpan dulu di variabel)<br>
c.  Menggunakan operator dan variabel<br>
d.  Menggunakan .format()

In [112]:
#a. 
print("Hello, my name is Cevin")
#b.
name = "Cevin"
print("Hello, my name is", name)
#c.
print("Hello, my name is " + name)
#d.
print("Hello, my name is {}".format(name))

Hello, my name is Cevin
Hello, my name is Cevin
Hello, my name is Cevin
Hello, my name is Cevin

II. Selesaikan soal cerita berikut menggunakan python:<br>
a.  Jose membeli 4 kotak kelereng, tiap kotak berisi 15 buah kelereng. Kelereng itu akan dibagikan kepada 12 orang temannya, setiap teman akan mendapat ... kelereng.<br>
b.  Hasil dari 8 pangkat 1/3 adalah ...<br>
c.  Eillen memiliki uang sebesar Rp 50.000 untuk dibelanjakan kertas binder, 1 paket kertas binder isi 100 lembar dijual seharga 7500, jika ia ingin membeli berapa kertas binder yang dapat ia beli dengan uang yang ia punya? Berapa kembalian yang diterima?

In [113]:
import math

In [114]:
#a. 
kotak = 4
isiperkotak = 15
jumlah_kelereng = kotak*isiperkotak
totalperanak = jumlah_kelereng/12
print("Jumlah yang didapatkan per orang adalah ",totalperanak)

#b.
hasil = math.pow(8, 1/3)
print("Hasil dari 8 pangkat 1/3 adalah", hasil)

#c.
uangellen = 50000
hargabinder = 7500
totalbinder = uangellen // hargabinder * 100
kembalian = uangellen % hargabinder
print("Eillen dapat membeli", totalbinder, " kertas binder.")
print("Kembalian yang diterima adalah Rp", kembalian)

Jumlah yang didapatkan per orang adalah  5.0
Hasil dari 8 pangkat 1/3 adalah 2.0
Eillen dapat membeli 600  kertas binder.
Kembalian yang diterima adalah Rp 5000

III. Tunjukan cara untuk mengonversi tipe-tipe data berikut:

1. "1000" -> 1000 (string ke int)
2. 5.25 -> 5 (float ke int)
3. 5 -> 5.0 (int ke float)
4. 1000 -> "1000" (int ke string)

Expected output:


![image.png]()

IV. String

"If you want to know what a man's like, take a good look at how he treats his inferiors, not his equals."

1. Tampilkan indeks ke 20 sampai 30 dari string di atas (indeks ke 30 ikut)
2. Bagaimana cara memisah string berdasarkan spasi (simpan dalam list)
3. Balik string di atas dengan menggunakan satu baris kode (menggunakan index)

In [115]:

quote = "If you want to know what a man's like, take a good look at how he treats his inferiors, not his equals."

substring = quote[20:31]

list_words = quote.split()

reversed_quote = quote[::-1]
print(substring, list_words, reversed_quote)

what a man' ['If', 'you', 'want', 'to', 'know', 'what', 'a', "man's", 'like,', 'take', 'a', 'good', 'look', 'at', 'how', 'he', 'treats', 'his', 'inferiors,', 'not', 'his', 'equals.'] .slauqe sih ton ,sroirefni sih staert eh woh ta kool doog a ekat ,ekil s'nam a tahw wonk ot tnaw uoy fI

<h2> Python Data Strcutures

I. Tuple


1.   Buatlah sebuah tuple yang berisikan nama prodi di UC, simpan dalam variabel "Prodi".
2.   Cetaklah panjang tuple yang dibuat.
3.   Gunakan .index() untuk mengetahui posisi/index prodi ISB

In [116]:
# 1. Buat tuple berisikan nama prodi di UC
Prodi = ("IMT", "IBM", "FTP", "FK", "ACC", "ISB", "PSY")

# 2. Cetak panjang tuple yang dibuat
print("Panjang tuple Prodi adalah:", len(Prodi))

# 3. Gunakan .index() untuk mengetahui posisi/index prodi ISB
index_isb = Prodi.index("ISB")
print("Index dari prodi ISB adalah:", index_isb)

Panjang tuple Prodi adalah: 7
Index dari prodi ISB adalah: 5

II. List


1.   Buatlah sebuah list berisi 3 nama makanan kesukaanmu. Simpan dalam variabel "favorit".
2.   Cetak nama setiap makanan dengan mengakses setiap elemen dalam list satu persatu.
3. Kamu sedang berada di sebuah restoran dan hendak memesan salah satu menu yang ada dalam daftar favoritmu. Cetak setiap makanan dengan contoh: "Aku ingin pesan {nama makanan}"
4.   Ternyata, salah satu menu tidak tersedia, jadi kamu perlu memesan makanan lain. Ganti makanan yang kosong dengan nama makanan baru (makanan yang mana bebas)

In [117]:
#1
favorit = ["Nasi Goreng", "Indomie", "Sate"]

#2
print("Makanan favoritku:")
print(favorit[0])
print(favorit[1])
print(favorit[2])

#3
print(f"Aku ingin pesan {favorit[2]}")

#4
favorit[1] = "Mie Ayam"
print(f"Aku ingin pesan {favorit[1]}")

Makanan favoritku:
Nasi Goreng
Indomie
Sate
Aku ingin pesan Sate
Aku ingin pesan Mie Ayam

III. Set

1. Buatlah 4 buah set sebagai berikut


    set1 = {1, 2, 3, 4}
    set2 = {2, 4, 6, 8}
    set3 = {5, 7}
    set4 = {2, 3}
2. Gabungkan set1 dan set2 dengan menghilangkan duplicates
3. Buktikan set1 dan set3 tidak mempunyai intersection (output : Boolean)
4. Buktikan set4 adalah bagian dari set1 (output : Boolean)

In [118]:
set1 = {1, 2, 3, 4}
set2 = {2, 4, 6, 8}
set3 = {5, 7}
set4 = {2, 3}

gabungan_set = set1.union(set2)
print(gabungan_set)


tidak_ada_intersection = set1.isdisjoint(set3)
print(tidak_ada_intersection)

set4_subset_set1 = set4.issubset(set1)
print(set4_subset_set1)

{1, 2, 3, 4, 6, 8}
True
True

<h2> Python Programming Fundamentals

I. Buatlah sebuah program sederhana yang meminta inputan dari user berupa jumlah penggunaan listrik dan menghasilkan output berupa tarif yang harus dibayar dengan syarat sebagai berikut:

PLN menerapkan pembayaran listrik perumahan dengan perhitungan sebagai berikut:
* untuk golongan 1 (penggunaan <1000 kWh) tarif : Rp1000/kWh
* untuk golongan 2 (penggunaan >= 1000 kWh) tarif : Rp2000/kWh

Dengan syarat perhitungan:

Minimum pembayaran adalah 100 kWh sedangkan untuk pemakaian 1000 kWh dan seterusnya tarifnya ditambah 10% dari total pembayaran.

(Jika total penggunaan <100 kWh, maka akan dikenakan tarif 100 kWh)

In [119]:
penggunaan = int(input("Masukkan jumlah penggunaan listrik (kWh): "))

if penggunaan < 100:
    penggunaan = 100

if penggunaan < 1000:
    tarif = penggunaan * 1000
else:
    tarif = penggunaan * 2000
    tarif += tarif * 0.1

print(f"Penggunaan listrik: {penggunaan} kWh")
print(f"Tarif yang harus dibayar: Rp {tarif}")

Penggunaan listrik: 1500 kWh
Tarif yang harus dibayar: Rp 3300000.0

II. Untuk Abdimas Oweek UC digunakan angkot dengan kapasitas 10 orang per angkot. Apabila terjadi kelebihan penumpang (walau hanya 1 orang), angkot yang digunakan ditambah 1. Tulislah program untuk menghitung jumlah angkot yang diperlukan bila jumlah pesertanya menggunakan input().

Catatan, pastikan jika angka yang dimasukkan negatif, muncul peringatan "Jumlah orang tidak bisa negatif!"

In [120]:
def minta_jumlah_peserta():
    while True:
        try:
            jumlah_peserta = int(input("Masukkan jumlah peserta: "))
            if jumlah_peserta < 0:
                print("Jumlah orang tidak bisa negatif!")
            else:
                return jumlah_peserta
        except ValueError:
            print("Input tidak valid. Masukkan angka yang benar.")

jumlah_peserta = minta_jumlah_peserta()

kapasitas_angkot = 10

jumlah_angkot = (jumlah_peserta + kapasitas_angkot - 1) // kapasitas_angkot

print(f"Jumlah peserta: {jumlah_peserta}")
print(f"Jumlah angkot yang diperlukan: {jumlah_angkot}")

Jumlah peserta: 101
Jumlah angkot yang diperlukan: 11

<h2> Numpy

1. Buatlah 1D numpy array berisi nama nama hari dalam satu minggu
2. Gunakan sort untuk mengurutkan array sesuai abjad
3. Gunakan rand untuk mengambil 1 hari dari array, cetakhlah dalam format: "Selamat hari \<nama hari\> adalah hari baikmu bulan ini!"
4. Buatlah matriks 3x4 menggunakan numpy array berisi angka 1-6, lalu cetak shape dan dimensi array
5. Cetaklah elemen kolom ketiga dari matrix

    [[1 ,2, 3, 4],

    [5, 6, 7, 8],

    [9, 10, 11, 12]]
6. Gunakan reshape untuk mengubah matrix di atas menjadi matriks berukuran (2, 6)

In [121]:
# 1
import numpy as np

# 1. Membuat 1D array berisi nama hari dalam satu minggu
hari = np.array(["Senin", "Selasa", "Rabu", "Kamis", "Jumat", "Sabtu", "Minggu"])
print(hari)

['Senin' 'Selasa' 'Rabu' 'Kamis' 'Jumat' 'Sabtu' 'Minggu']

In [122]:
# 2
hari_sorted = np.sort(hari)
print(hari_sorted)

['Jumat' 'Kamis' 'Minggu' 'Rabu' 'Sabtu' 'Selasa' 'Senin']

In [123]:
import random
# 3
random_hari = np.random.choice(hari)
print(f"Selamat hari {random_hari}, adalah hari baikmu bulan ini!")

Selamat hari Selasa, adalah hari baikmu bulan ini!

In [124]:
# 4
matrix = np.array([[1, 2, 3, 4],
                   [5, 6, 7, 8],
                   [9, 10, 11, 12]])

print("\nMatriks 3x4:")
print("Shape dari matriks:", matrix.shape)
print("Dimensi dari matriks:", matrix.ndim)

Matriks 3x4:
Shape dari matriks: (3, 4)
Dimensi dari matriks: 2

In [125]:
# 5
print(matrix[:, 2])

[ 3  7 11]

In [126]:
# 6
matrix_reshaped = matrix.reshape(2, 6)
print(matrix_reshaped)

[[ 1  2  3  4  5  6]
 [ 7  8  9 10 11 12]]

<h2> Pandas

1. Buatlah Pandas Series dari list ["Information", "Systems", "for", "Business"]
2. Buatlah Pandas Dataframe dari dictionary
{ "brand": "Ford", "model": "Mustang", "year": 1964 }

In [127]:
import pandas as pd

# 1. Membuat Pandas Series dari list
list_words = ["Information", "Systems", "for", "Business"]
series_words = pd.Series(list_words)

# Menampilkan Series
print("Pandas Series dari list:")
print(series_words)

# 2. Membuat Pandas DataFrame dari dictionary
car_dict = { "brand": "Ford", "model": "Mustang", "year": 1964 }
df_car = pd.DataFrame([car_dict])

# Menampilkan DataFrame
print("\nPandas DataFrame dari dictionary:")
df_car.head()

Pandas Series dari list:
0    Information
1        Systems
2            for
3       Business
dtype: object

Pandas DataFrame dari dictionary:

  brand    model  year
0  Ford  Mustang  1964

3. Import dataset berikut kedalam dataframe.    
dataset : https://raw.githubusercontent.com/michellechandraa/TutorDataMining/main/50_Startups.csv
4. Tunjukan kota apa saja yang ada dalam dataset tersebut
5. Buatlah dataset baru yang menyimpan 10 row random dari dataset. Kemudian tunjukanlah 5 row pertamanya.
6. Gunakan df.info() untuk melihat informasi singkat dari dataframe
7. Tampilkan data 'R&D Spend' dan 'Marketing Spend' dari data yang berasal dari kota 'California'
8. Temukan apa ada missing value dari setiap kolom
9. Drop data yang memiliki profit di bawah 50000
10. Urutkan Dataframe berdasarkan biaya marketing mulai dari terbesar ke terkecil

In [128]:
# 3
url = "https://raw.githubusercontent.com/michellechandraa/TutorDataMining/main/50_Startups.csv"
df = pd.read_csv(url)
df.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

In [129]:
# 4
print(df['State'].unique())

['New York' 'California' 'Florida']

In [130]:
# 5
df_random = df.sample(n=10, random_state=42)
df_random.head()

    R&D Spend  Administration  Marketing Spend       State     Profit
13   91992.39       135495.07        252664.93  California  134307.35
39   38558.51        82982.09        174999.30  California   81005.76
30   61994.48       115641.28         91131.24     Florida   99937.59
45    1000.23       124153.04          1903.93    New York   64926.08
17   94657.16       145077.58        282574.31    New York  125370.37

In [131]:
# 6
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   R&D Spend        50 non-null     float64
 1   Administration   50 non-null     float64
 2   Marketing Spend  50 non-null     float64
 3   State            50 non-null     object
 4   Profit           50 non-null     float64
dtypes: float64(4), object(1)
memory usage: 2.1+ KB

In [132]:
# 7
california_data = df[df['State'] == 'California'][['R&D Spend', 'Marketing Spend']]
california_data.head()

    R&D Spend  Marketing Spend
1   162597.70        443898.53
6   134615.46        127716.82
9   123334.88        304981.62
11  100671.96        249744.55
13   91992.39        252664.93

In [133]:
# 8
print(df.isnull().sum())

R&D Spend          0
Administration     0
Marketing Spend    0
State              0
Profit             0
dtype: int64

In [134]:
# 9
df_filtered = df.drop(df[df['Profit'] < 50000].index)
print(len(df_filtered))

46

In [135]:
# 10
df_sorted = df.sort_values('Marketing Spend', ascending=False)
df_sorted.head()

   R&D Spend  Administration  Marketing Spend       State     Profit
0  165349.20       136897.80        471784.10    New York  192261.83
1  162597.70       151377.59        443898.53  California  191792.06
2  153441.51       101145.55        407934.54     Florida  191050.39
3  144372.41       118671.85        383199.62    New York  182901.99
4  142107.34        91391.77        366168.42     Florida  166187.94

<h2> Data Cleaning

1. Import dataset berikut ke dalam dataframe.   
   dataset : https://raw.githubusercontent.com/michellechandraa/TutorDataMining/main/real_estate.csv
2. Tampilkan 10 data random dari dataset di atas
3. Cari informasi data dengan menggunakan fungsi describe
4. Hapus kolom 'No' dan ubahlah nama kolom dalam dataframe menjadi 'transaction date', 'house age', 'distance to the nearest MRT station', 'number of convinience stores', 'latitude', 'longitude', 'house price of unit area'
5. Cek apakah ada missing values dari masing-masing kolom

In [136]:
# 1
url = "https://raw.githubusercontent.com/michellechandraa/TutorDataMining/main/real_estate.csv"
df = pd.read_csv(url)
df.head()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
0,1,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,3,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,4,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,5,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

In [137]:
# 2
df.sample(10)

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
99,100,2013.417,6.4,90.45606,9,24.97433,121.54310,62.2
329,330,2013.000,13.6,4197.34900,0,24.93885,121.50383,19.2
149,150,2012.667,34.9,179.45380,8,24.97349,121.54245,39.7
268,269,2013.417,17.2,390.56840,5,24.97937,121.54245,40.1
62,63,2012.917,17.2,2175.87700,3,24.96303,121.51254,27.7
364,365,2013.417,35.3,614.13940,7,24.97913,121.53666,33.1
272,273,2012.750,13.0,492.23130,5,24.96515,121.53737,40.5
80,81,2013.500,11.8,533.47620,4,24.97445,121.54765,40.3
321,322,2012.917,16.9,964.74960,4,24.98872,121.53411,37.7
34,35,2012.750,15.4,205.36700,7,24.98419,121.54243,55.1

In [138]:
# 3
df.describe()

,No,X1 transaction date,X2 house age,X3 distance to the nearest MRT station,X4 number of convenience stores,X5 latitude,X6 longitude,Y house price of unit area
count,414.000000,414.000000,414.000000,414.000000,414.000000,414.000000,414.000000,414.000000
mean,207.500000,2013.148971,17.712560,1083.885689,4.094203,24.969030,121.533361,37.980193
std,119.655756,0.281967,11.392485,1262.109595,2.945562,0.012410,0.015347,13.606488
min,1.000000,2012.667000,0.000000,23.382840,0.000000,24.932070,121.473530,7.600000
25%,104.250000,2012.917000,9.025000,289.324800,1.000000,24.963000,121.528085,27.700000
50%,207.500000,2013.167000,16.100000,492.231300,4.000000,24.971100,121.538630,38.450000
75%,310.750000,2013.417000,28.150000,1454.279000,6.000000,24.977455,121.543305,46.600000
max,414.000000,2013.583000,43.800000,6488.021000,10.000000,25.014590,121.566270,117.500000

In [145]:
# 4
droppeddf = df.drop(columns=['No'])
droppeddf.columns = ['transaction date', 'house age', 'distance to the nearest MRT station', 'number of convinience stores', 'latitude', 'longitude', 'house price of unit area']

droppeddf.head()

,transaction date,house age,distance to the nearest MRT station,number of convinience stores,latitude,longitude,house price of unit area
0,2012.917,32.0,84.87882,10,24.98298,121.54024,37.9
1,2012.917,19.5,306.59470,9,24.98034,121.53951,42.2
2,2013.583,13.3,561.98450,5,24.98746,121.54391,47.3
3,2013.500,13.3,561.98450,5,24.98746,121.54391,54.8
4,2012.833,5.0,390.56840,5,24.97937,121.54245,43.1

In [146]:
# 5
print(df.isnull().sum())

No                                        0
X1 transaction date                       0
X2 house age                              0
X3 distance to the nearest MRT station    0
X4 number of convenience stores           0
X5 latitude                               0
X6 longitude                              0
Y house price of unit area                0
dtype: int64

## **Goodluck :)**